In [152]:
import pandas as pd
import csv
import glob
import os
import numpy as np

In [456]:
# Lets create the dataframe for tesco.csv file

files = []

inputPath = "/Users/ravikiranmandha/PycharmProjects/Graze_Data_Engineer/graze-data-engineer-test/files/"

for file in glob.glob(inputPath + '*csv'):
    
    files.append(file)

In [457]:
# Lets load the waitrose.csv file into the tesco dataframe
waitrose_df = pd.read_csv(files[0])

In [458]:
#We can now check the head of the waitrose_df
waitrose_df.head()

,retailer,store,product_id,product_name,week_commencing,sales_units,sales_value
0,Waitrose,Manchester,1,Graze BBQ Crunch,03/05/2019,133,£159.60
1,Waitrose,Manchester,1,Graze BBQ Crunch,10/05/2019,193,£231.60
2,Waitrose,Manchester,1,Graze BBQ Crunch,17/05/2019,185,£222
3,Waitrose,Manchester,2,Graze Veggie Protein Power,03/05/2019,31,£37.20
4,Waitrose,Manchester,2,Graze Veggie Protein Power,10/05/2019,124,£148.80

In [459]:
# Let validate the data types for each of the columns in the dataframe
waitrose_df.dtypes

retailer           object
store              object
product_id          int64
product_name       object
week_commencing    object
sales_units         int64
sales_value        object
dtype: object

In [460]:
# info provides more information about our dataframe
waitrose_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
retailer           120 non-null object
store              120 non-null object
product_id         120 non-null int64
product_name       120 non-null object
week_commencing    120 non-null object
sales_units        120 non-null int64
sales_value        120 non-null object
dtypes: int64(2), object(5)
memory usage: 6.7+ KB

In [461]:
# We note that the "week_commencing" column should be datetime64 instead of object datatype. Lets convert it first.

waitrose_df['week_commencing'] = waitrose_df['week_commencing'].astype('datetime64[ns]')

In [462]:
# We can now verify if the data type has been changed for the week_commencing column
waitrose_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
retailer           120 non-null object
store              120 non-null object
product_id         120 non-null int64
product_name       120 non-null object
week_commencing    120 non-null datetime64[ns]
sales_units        120 non-null int64
sales_value        120 non-null object
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 6.7+ KB

In [463]:
# Note that the sales_value column is stored as non-null object this would prevent us from performing any calculations.
waitrose_df['sales_value'].head()

0    £159.60
1    £231.60
2       £222
3     £37.20
4    £148.80
Name: sales_value, dtype: object

In [464]:
# Lets try to convert into a float value using astype function.
waitrose_df['sales_value'] = waitrose_df['sales_value'].astype(float)

ValueError: could not convert string to float: '£21.60'

In [465]:
# As the astype function is failing to convert the datatype. We might have to write a custom function to clean it up.

def convert_currency(val):
    """
    Convert the string number value to a float
     - Remove £ (Pound symbol)
     - Convert to float type
    """
    new_val = val.replace('£', '')
    return float(new_val)

# Let's validate if our custom function is working as expected
convert_currency('£231.60')

231.6

In [466]:
# We can use apply function to make changes to the entire column
waitrose_df['sales_value'].apply(convert_currency)

0      159.6
1      231.6
2      222.0
3       37.2
4      148.8
       ...
115     52.8
116     10.8
117     26.4
118     58.8
119     21.6
Name: sales_value, Length: 120, dtype: float64

In [526]:
# Let's do all of these steps at once.
parse_dates = ['Week_Commencing']
column_list = ["Retailer", "Store", "Product_Id", "Product_Name", "Week_Commencing", "Sales_Units", "Sales_Value"]
waitrose_df = pd.read_csv(files[0], skiprows=1,
                    names=column_list,
                   parse_dates=parse_dates,
                   converters={'Sales_Value': convert_currency})

In [527]:
waitrose_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
Retailer           120 non-null object
Store              120 non-null object
Product_Id         120 non-null int64
Product_Name       120 non-null object
Week_Commencing    120 non-null datetime64[ns]
Sales_Units        120 non-null int64
Sales_Value        120 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 6.7+ KB

In [528]:
waitrose_df.head()

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Sales_Units,Sales_Value
0,Waitrose,Manchester,1,Graze BBQ Crunch,2019-03-05,133,159.6
1,Waitrose,Manchester,1,Graze BBQ Crunch,2019-10-05,193,231.6
2,Waitrose,Manchester,1,Graze BBQ Crunch,2019-05-17,185,222.0
3,Waitrose,Manchester,2,Graze Veggie Protein Power,2019-03-05,31,37.2
4,Waitrose,Manchester,2,Graze Veggie Protein Power,2019-10-05,124,148.8

In [470]:
# Now lets look at the tesco.csv file
tesco_df = pd.read_csv(files[1])

In [471]:
# Let's take a peek at the data inside the dataframe
tesco_df.head()

,retailer,store,product_id,product_name,week_commencing,metric,value
0,Tesco,Manchester,1,Graze BBQ Crunch,03/05/2019,sales units,109
1,Tesco,Manchester,1,Graze BBQ Crunch,10/05/2019,sales units,45
2,Tesco,Manchester,1,Graze BBQ Crunch,17/05/2019,sales units,294
3,Tesco,Manchester,2,Graze Veggie Protein Power,03/05/2019,sales units,33
4,Tesco,Manchester,2,Graze Veggie Protein Power,10/05/2019,sales units,143

In [219]:
# We can look at the tail of the dataframe as well.
tesco_df.tail()

,retailer,store,product_id,product_name,week_commencing,metric,value
235,Tesco,Reading,3,Graze Lively Lemon Flapjack,10/05/2019,sales value,£292.8
236,Tesco,Reading,3,Graze Lively Lemon Flapjack,17/05/2019,sales value,£357.6
237,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,03/05/2019,sales value,£26.4
238,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,10/05/2019,sales value,£405.6
239,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,17/05/2019,sales value,£350.4

In [87]:
# We can look at the data types of the dataframe.
tesco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 7 columns):
retailer           240 non-null object
store              240 non-null object
product_id         240 non-null int64
product_name       240 non-null object
week_commencing    240 non-null object
metric             240 non-null object
value              240 non-null object
dtypes: int64(1), object(6)
memory usage: 13.2+ KB

In [384]:
"""
We need to change the data type of "week_commencing" column from object type to datetime64 and 
correct the sales curreny to a float type to perform calculations.
"""
parse_dates = ['Week_Commencing']
column_list = ['Retailer', 'Store', 'Product_id', 'Product_Name', 'Week_Commencing', 'Metric', 'Value']
tesco_df = pd.read_csv(files[1], skiprows=1, 
                       names=column_list, 
                       parse_dates=parse_dates,
                      )

In [385]:
# Let's check if the dataframe has been updated.
tesco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 7 columns):
Retailer           240 non-null object
Store              240 non-null object
Product_id         240 non-null int64
Product_Name       240 non-null object
Week_Commencing    240 non-null datetime64[ns]
Metric             240 non-null object
Value              240 non-null object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 13.2+ KB

In [386]:
# Let's take a look at the data in the dataframe.
tesco_df.head()

,Retailer,Store,Product_id,Product_Name,Week_Commencing,Metric,Value
0,Tesco,Manchester,1,Graze BBQ Crunch,2019-03-05,sales units,109
1,Tesco,Manchester,1,Graze BBQ Crunch,2019-10-05,sales units,45
2,Tesco,Manchester,1,Graze BBQ Crunch,2019-05-17,sales units,294
3,Tesco,Manchester,2,Graze Veggie Protein Power,2019-03-05,sales units,33
4,Tesco,Manchester,2,Graze Veggie Protein Power,2019-10-05,sales units,143

In [387]:
# Now look at the tail of the dataframe as well, we note that the bottom show pound values not int values.
tesco_df.tail()

,Retailer,Store,Product_id,Product_Name,Week_Commencing,Metric,Value
235,Tesco,Reading,3,Graze Lively Lemon Flapjack,2019-10-05,sales value,£292.8
236,Tesco,Reading,3,Graze Lively Lemon Flapjack,2019-05-17,sales value,£357.6
237,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-03-05,sales value,£26.4
238,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-10-05,sales value,£405.6
239,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-05-17,sales value,£350.4

In [320]:
del tesco_df['test']

In [581]:
"""
As we noted that the first 119 rows are Sales Units and the remaining rows till 239 are Sales Value. 
We can split them into two different dataframes and select only the columns we need. Aslo, noted that
the same rows have been repeated except for the Value column.
"""
# We are selecting rows from start to 119 and all columns using the iloc function.
test1_df = tesco_df.iloc[:120, :]
test1_df.columns = ["Retailer", "Store", "Product_Id", "Product_Name", "Week_Commencing", "Metric", "Sales_Units"]
# We are going to select the rows 120:239 which contain the "Sales Value" and select only the Values column.
# We need to use to_frame() function as the series needs to be converted into DataFrame and reset the index to be from 0 10 119.
test2_df = tesco_df.iloc[120:240, 6].to_frame().reset_index(drop=True)
test2_df.columns = ["Sales_Value"]

In [582]:
type(test2_df)

pandas.core.frame.DataFrame

In [584]:
# Lets check the head and tail of test1_df to ensure we split the dataframe properly.
test1_df.head()

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Metric,Sales_Units
0,Tesco,Manchester,1,Graze BBQ Crunch,03/05/2019,sales units,109
1,Tesco,Manchester,1,Graze BBQ Crunch,10/05/2019,sales units,45
2,Tesco,Manchester,1,Graze BBQ Crunch,17/05/2019,sales units,294
3,Tesco,Manchester,2,Graze Veggie Protein Power,03/05/2019,sales units,33
4,Tesco,Manchester,2,Graze Veggie Protein Power,10/05/2019,sales units,143

In [578]:
# Lets check the head and tail of test1_df to ensure we split the dataframe properly.
test1_df.tail()

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Metric,Sales_Units
115,Tesco,Reading,3,Graze Lively Lemon Flapjack,2019-10-05,sales units,244
116,Tesco,Reading,3,Graze Lively Lemon Flapjack,2019-05-17,sales units,298
117,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-03-05,sales units,22
118,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-10-05,sales units,338
119,Tesco,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-05-17,sales units,292

In [585]:
# We can now drop the "Metric" Column which is no longer needed as we have split the values.
del test1_df['Metric']

In [586]:
# We can now check to ensure it has been deleted.
test1_df.columns

Index(['Retailer', 'Store', 'Product_Id', 'Product_Name', 'Week_Commencing',
       'Sales_Units'],
      dtype='object')

In [587]:
# Lets check the head of test2_df.
test2_df.head()

  Sales_Value
0      £130.8
1         £54
2      £352.8
3       £39.6
4      £171.6

In [588]:
# We can combine both the dataframes into one final dataframe.
final_df = test1_df.join(test2_df)

In [589]:
# Lets check the values of final df.
final_df.head()

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Sales_Units,Sales_Value
0,Tesco,Manchester,1,Graze BBQ Crunch,03/05/2019,109,£130.8
1,Tesco,Manchester,1,Graze BBQ Crunch,10/05/2019,45,£54
2,Tesco,Manchester,1,Graze BBQ Crunch,17/05/2019,294,£352.8
3,Tesco,Manchester,2,Graze Veggie Protein Power,03/05/2019,33,£39.6
4,Tesco,Manchester,2,Graze Veggie Protein Power,10/05/2019,143,£171.6

In [590]:
# Lets do a quick info on the final_df
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
Retailer           120 non-null object
Store              120 non-null object
Product_Id         120 non-null int64
Product_Name       120 non-null object
Week_Commencing    120 non-null object
Sales_Units        120 non-null object
Sales_Value        120 non-null object
dtypes: int64(1), object(6)
memory usage: 6.7+ KB

In [563]:
# Let's update the data type of Sales_Units column to Int to match with Waitrose and be consistent for merging.
final_df['Sales_Units'] = final_df['Sales_Units'].astype('int64')

In [591]:
# We need to modify the Curreny Value in Sales_Value column to float64 for future calculations.
final_df['Sales_Value'] = final_df['Sales_Value'].apply(convert_currency)

In [592]:
# Let's update the data type of "Week_Commencing" column which is currently set to "Object Type".
final_df['Week_Commencing'] = final_df['Week_Commencing'].astype('datetime64')

In [602]:
# We could verify if all of the data types have been updated based on the above steps taken.
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
Retailer           120 non-null object
Store              120 non-null object
Product_Id         120 non-null int64
Product_Name       120 non-null object
Week_Commencing    120 non-null datetime64[ns]
Sales_Units        120 non-null object
Sales_Value        120 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 6.7+ KB

In [594]:
waitrose_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
Retailer           120 non-null object
Store              120 non-null object
Product_Id         120 non-null int64
Product_Name       120 non-null object
Week_Commencing    120 non-null datetime64[ns]
Sales_Units        120 non-null int64
Sales_Value        120 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 6.7+ KB

In [603]:
"""
Finally we can merge both Waitrose_df and Tesco_df into 1 single dataframe or 
CSV file that can be loaded into the Database table.
"""
dbready_df = pd.concat([final_df, waitrose_df], ignore_index=True)

In [600]:
# Let's check the dataframe is combined and have a proper dataframe now.
dbready_df

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Sales_Units,Sales_Value
0,Tesco,Manchester,1,Graze BBQ Crunch,2019-03-05,109,130.8
1,Tesco,Manchester,1,Graze BBQ Crunch,2019-10-05,45,54.0
2,Tesco,Manchester,1,Graze BBQ Crunch,2019-05-17,294,352.8
3,Tesco,Manchester,2,Graze Veggie Protein Power,2019-03-05,33,39.6
4,Tesco,Manchester,2,Graze Veggie Protein Power,2019-10-05,143,171.6
...,...,...,...,...,...,...,...
235,Waitrose,Reading,3,Graze Lively Lemon Flapjack,2019-10-05,44,52.8
236,Waitrose,Reading,3,Graze Lively Lemon Flapjack,2019-05-17,9,10.8
237,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-03-05,22,26.4
238,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-10-05,49,58.8
239,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-05-17,18,21.6

In [604]:
# We can verify the last 5 rows of the final dataframe that's ready to be uploaded into the database.
dbready_df.tail()

,Retailer,Store,Product_Id,Product_Name,Week_Commencing,Sales_Units,Sales_Value
235,Waitrose,Reading,3,Graze Lively Lemon Flapjack,2019-10-05,44,52.8
236,Waitrose,Reading,3,Graze Lively Lemon Flapjack,2019-05-17,9,10.8
237,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-03-05,22,26.4
238,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-10-05,49,58.8
239,Waitrose,Reading,4,Graze Cocoa & Vanilla Flapjack,2019-05-17,18,21.6